In [41]:
import pandas as pd

### Carregamento dos Dados

In [42]:
acessos = pd.read_excel('compras_e_acessos.xlsx', sheet_name='acessos')

In [43]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [44]:
compras = pd.read_excel('compras_e_acessos.xlsx', sheet_name='compras')

In [45]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

Merge

###### SQL JOIN: Usuarios que tem acesso E compras, trazendo tambem as informações de ambas as tabelas

In [46]:
inner_join = acessos.merge(compras, how='inner', on='user_id')

In [47]:
inner_join

   user_id user_name_x  total_x user_name_y  total_y
0        3    GABRIELA        2    GABRIELA      100
1        5      REBECA      399      REBECA       22
2        6       PEDRO       21       PEDRO      332

###### SQL LEFTH JOIN: Usuarios que tem acesso , mas tambem queremos trazer o total de compras, caso tenha feito

In [48]:
left_join = acessos.merge(compras, how='left', on='user_id')

In [49]:
left_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN       10         NaN      NaN
1        3    GABRIELA        2    GABRIELA    100.0
2        5      REBECA      399      REBECA     22.0
3        6       PEDRO       21       PEDRO    332.0
4        7       JAMES        1         NaN      NaN

###### SQL RIGHT JOIN: Usuarios que tem acesso, MAS TAMBEM QUEREMOS TRAZER O TOTAL DE ACESSOS, CASO TENHAM FEITO

In [50]:
right_join = acessos.merge(compras, how='right', on='user_id')

In [51]:
right_join

   user_id user_name_x  total_x user_name_y  total_y
0        2         NaN      NaN        JOÃO       78
1        3    GABRIELA      2.0    GABRIELA      100
2        5      REBECA    399.0      REBECA       22
3        6       PEDRO     21.0       PEDRO      332
4        1         NaN      NaN     MARIANA       13

###### SQL FULL JOIN: USUARIOS QUE TEM ACESSOS ou COMPRAS, trazendo as informações de ambos, caso existam

In [52]:
full_join = acessos.merge(compras, how='outer', on='user_id')

In [53]:
full_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN     10.0         NaN      NaN
1        3    GABRIELA      2.0    GABRIELA    100.0
2        5      REBECA    399.0      REBECA     22.0
3        6       PEDRO     21.0       PEDRO    332.0
4        7       JAMES      1.0         NaN      NaN
5        2         NaN      NaN        JOÃO     78.0
6        1         NaN      NaN     MARIANA     13.0

In [54]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [55]:
nova_linha ={'user_name': 'Total'}

In [56]:
acessos = acessos._append(nova_linha, ignore_index=True )

In [57]:
acessos

   user_id user_name  total
0      8.0     RENAN   10.0
1      3.0  GABRIELA    2.0
2      5.0    REBECA  399.0
3      6.0     PEDRO   21.0
4      7.0     JAMES    1.0
5      NaN     Total    NaN

In [58]:
soma_total = acessos['total'].sum()

In [59]:
soma_total

433.0

In [60]:
acessos.loc[5,'total'] = soma_total

In [61]:
acessos

   user_id user_name  total
0      8.0     RENAN   10.0
1      3.0  GABRIELA    2.0
2      5.0    REBECA  399.0
3      6.0     PEDRO   21.0
4      7.0     JAMES    1.0
5      NaN     Total  433.0

In [62]:
acessos.loc[5,'user_id'] = 'Resultado'

C:\Users\Leandro\AppData\Local\Temp\ipykernel_14576\3005151549.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Resultado' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  acessos.loc[5,'user_id'] = 'Resultado'

In [63]:
acessos

     user_id user_name  total
0        8.0     RENAN   10.0
1        3.0  GABRIELA    2.0
2        5.0    REBECA  399.0
3        6.0     PEDRO   21.0
4        7.0     JAMES    1.0
5  Resultado     Total  433.0

In [64]:
acessos.loc[6,'total'] = acessos['total'].mean()

In [65]:
acessos

     user_id user_name       total
0        8.0     RENAN   10.000000
1        3.0  GABRIELA    2.000000
2        5.0    REBECA  399.000000
3        6.0     PEDRO   21.000000
4        7.0     JAMES    1.000000
5  Resultado     Total  433.000000
6        NaN       NaN  144.333333

#### MERGE SEM INTERSECÇÃO

In [66]:
acessos = acessos.drop([5,6])

In [67]:
acessos

  user_id user_name  total
0     8.0     RENAN   10.0
1     3.0  GABRIELA    2.0
2     5.0    REBECA  399.0
3     6.0     PEDRO   21.0
4     7.0     JAMES    1.0

In [68]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

sql left join : usuarios que tem acessos, mas nao tenham compras

In [69]:
left_join1 = acessos.merge(compras, how='left', on='user_id', indicator=True)

In [70]:
left_join1

  user_id user_name_x  total_x user_name_y  total_y     _merge
0     8.0       RENAN     10.0         NaN      NaN  left_only
1     3.0    GABRIELA      2.0    GABRIELA    100.0       both
2     5.0      REBECA    399.0      REBECA     22.0       both
3     6.0       PEDRO     21.0       PEDRO    332.0       both
4     7.0       JAMES      1.0         NaN      NaN  left_only

In [71]:
left_join1 = left_join1[left_join1._merge == 'left_only']

In [72]:
left_join1

  user_id user_name_x  total_x user_name_y  total_y     _merge
0     8.0       RENAN     10.0         NaN      NaN  left_only
4     7.0       JAMES      1.0         NaN      NaN  left_only

SQL RIGHT JOIN: Usuariosque tem compras, mas nao tenham acessos

In [73]:
right_join = acessos.merge(compras, how='right', on='user_id', indicator=True)

In [74]:
right_join

  user_id user_name_x  total_x user_name_y  total_y      _merge
0       2         NaN      NaN        JOÃO       78  right_only
1     3.0    GABRIELA      2.0    GABRIELA      100        both
2     5.0      REBECA    399.0      REBECA       22        both
3     6.0       PEDRO     21.0       PEDRO      332        both
4       1         NaN      NaN     MARIANA       13  right_only

In [75]:
right_join = right_join[right_join._merge == 'right_only']

In [76]:
right_join

  user_id user_name_x  total_x user_name_y  total_y      _merge
0       2         NaN      NaN        JOÃO       78  right_only
4       1         NaN      NaN     MARIANA       13  right_only

SQL FULL JOIN: Usuarios que tem acessos OU compras, mas que nao tenham os doisa ao mesmo tempo

In [77]:
full_join = acessos.merge(compras, how='outer', on='user_id', indicator=True)

In [78]:
full_join

  user_id user_name_x  total_x user_name_y  total_y      _merge
0     8.0       RENAN     10.0         NaN      NaN   left_only
1     3.0    GABRIELA      2.0    GABRIELA    100.0        both
2     5.0      REBECA    399.0      REBECA     22.0        both
3     6.0       PEDRO     21.0       PEDRO    332.0        both
4     7.0       JAMES      1.0         NaN      NaN   left_only
5       2         NaN      NaN        JOÃO     78.0  right_only
6       1         NaN      NaN     MARIANA     13.0  right_only

In [79]:
full_join = full_join[full_join._merge != 'both']

In [80]:
full_join

  user_id user_name_x  total_x user_name_y  total_y      _merge
0     8.0       RENAN     10.0         NaN      NaN   left_only
4     7.0       JAMES      1.0         NaN      NaN   left_only
5       2         NaN      NaN        JOÃO     78.0  right_only
6       1         NaN      NaN     MARIANA     13.0  right_only